"""day 24:
     თქვენი დავალება იქნება რომ გუნდურ პროექტებზე დაიწყოთ მუშაობა, შეკრიბოთ გუნდი და შემდეგი გაკვეთილისთვის მოამზადოთ პრეზენტაცია, ასევე პლიუს კარგი იქნება თუ სიებზე გაივარჯიშებთ თქვენით, მეტი დავალება არგექნებათ მთელი დრო და ენერგია დაუთმეთ პროექტებს, აბა თქვენ იცით წარმატებები 😉"""

# task 1
name = ["Ana", "nini", "giorgi", 'niko', 'saba', 'nista', 'dato', 'manana', 'levani', 'mari']
print(name)

# task 2
print(name[3])

# task 3
name[0] = 'ana'
print(name)

# task 4
print(len(name))

# task 5
name_1 = "ANA"
print(len(name_1)) 