"""    1) შექმენით მენტორების სახელების სია და ჩვეულებრივი სახელებისთვის განკუთვნილი სია შემდეგ მომხმარებელს შემოატანინეთ სახელი თუ ეს სახელი იქნება რომელიმე მენტორის სახელი ამ შემთხვევაში ეს სახელი დაემატოს მენტორებისთვის განკუთვნილ სიაში სხვა შემთხვევაში თუარიქნება ეს სახელი მენტორის სახელი დაემატოს ჩვეულებრივი სახელების სიაში შემდეგ კი ორივე დაბეჭდეთ """

name_1 = []
name_2 = []
name = input("Enter name: ")
if name.upper == "GABRIELi" or name == "DAVITI" or name == "BERDIA" or name == "GURAMI" or name.upper == "LUKA":
    name_1.append(name)
else:
    name_2.append(name)

print(name_1)
print(name_2)