/* 
დააყენეთ node(ვისაც არ გაქვთ), შექმენით package.json ფაილი და npm დან გადმოიწერეთ რაიმე package(ნებისმიერი თქვენ რაც გაგეხარდებათ). შექმენით js ფაილი, დააიმპორტეთ ეს თქვენი package და გამოიყენეთ მისი რამოდენიმე ფუნცქია თუ მეთოდი. 
კომენტარის სახით ახსენით: 
    -რა არის node, რისთვის გვჭირდება.
    -რა არის package.json ფაილი და რა ინფორმაციას ინახავს იგი.
    -ახსენით რა package დააყენეთ, რას აკეთებს და რისთვის/რაში გამოიყენება.
დასტარტეთ თქვენი კოდი node საშუალებით
 წარმატებები
*/

// -რა არის node, რისთვის გვჭირდება ?
//      Node.js - არის JavaScript-ის ახალი ვარიანტი (მისი ბიბლიოთეკა), რომელიც გაძლევს საშუალებას ბრაუზერის გარეთაც (მაგალითად, სერვერზე) გაუშვათ JavaScript-ის კოდი.
//      შეგვიძლია რეაქთის გამოყენებით სერვერზე გაშვება.


// -რა არის package.json ფაილი და რა ინფორმაციას ინახავს იგი.
//      package.json არის Node.js -ის კონფიგურაციის ფაილი, სადაც ინახება ინფორმაცია პროექტის შესახებ და ყველა ის მონაცემი, რაც პროექტს სჭირდება სწორად მუშაობისთვის.


// -ახსენით რა package დააყენეთ, რას აკეთებს და რისთვის/რაში გამოიყენება.
//      vite არის package, რომელიც გამოიყენება პროექტების სწრაფად შექმნისთვის.