// 3) როგორ უნდა გავანახლოთ ასეთი state?

// let [value, setValue] = useState(
//                                {name: 'Ana', 
//                                 Lastname: 'Puturidze' })

// წარმოვიდგინოთ, რომ გვაქს უკვე useState შექმნილი. იმისათვის რომ მნიშვნელობა გავანახლოთ, პირველ რიგში შესაბამისი ფუნქცია უნდა გამოვიძახოთ. ანუ setValue

// setValue()-ს საწყის მნიშნელობად თუ ობიექტი ჰქონდა, მაშინ კვლავ ობიექტს გადავცემთ და გამოვიყენებთ spread ოპერატორს. spread ოპერატორი იწერება ...-ით და მარტივად რომ ვთქვათ რასაც ვუწერთ წინ, იმის კლონირებას აკეთებს და ერთმანეთისგან დამოუკიდებელი ხდება. აქ სპრედ ოპერატორი გვჭირდება იმ შემთხვევაში თუ დანარჩენი მნიშვნელობები რაც არის, (გასაღებები) მათი შენახვაც გვინდა. ასეთ შემთხვევაში ვიძახებთ ფუნქციას და არგუმენტად გადავცემთ ობიექტს სადაც ვინახავთ ოღონდ სპრედ ოპერატორით. და მერე ვწერთ ახალ გასაღებს და მის მნიშვნელობას. 

// მაგ:
// setValue({...value, newKey: newValue})


