'''  1) შექმენით ფუნქცია რომელიც დახატავს კვადრატს და გამოიძახეთ ის რამდენჯერმე ასევე თვენი სიტყვებით აღწერეთ რა არის ფუნქცია როგორ გაიგეთ და რისთვის გვჭირდება კომენტარების სახით'''

from turtle import*

def square():
    forward(200)
    right(90)
    forward(200)
    right(90)
    forward(200)
    right(90)
    forward(200)
    right(90)

square()
square()
square()
exitonclick()


#  def - define ფუნქციის შექმნა. ფუნქცია ამარტივებს კოდის წერას. ბევრჯერ აღარ არის საჭირო ერთი და იგივე კოდის წერა. გამოძახება არის შესაძლებელი