#3) შექმენით ცვლადი რომელიც იქნება credit და უნდა შექმნათ კიდე 2 ცვლადი რომელიც იქნება credit დიდი ასოებით და ახსენით კომენტარებით რა განსხვავებაა ამ ცვლადების შორის

credit = 100
CREDIT = 200
CREDIT = 250
# credit და CREDIT არის სხვადასხვა ცვლადები (python - ში ძირითადად პატარა ასოებით წერენ). დიდი ასოებითაც არის შესაძლებელი, მაგრამ უფრო სწორია პატარა ასოებით. ხოლო მე-2 და მე-3 ცვლადებს შორის განსხვავება ის არის, რომ კომპიუტერი თანმიმდევრულად კითხულობს ყველაფერს და თავიდან ცვლადის მნიშვნელობა სხვა იყო და შემდეგ სხვა გახდა. 