# შექმენი ლექსიკონი (dict) bike, სადაც brand-ის მნიშვნელობას აიღებ key-ის მიხედვით.

bike = {
    "brand": "Kawasaki",
    "model": "Ninja H2R",
    "year": 2015
}

# ვარიანტი 1
print(bike["brand"])

# ვარიანტი 2
print(bike.get("brand"))


# განსხვავება:
# bike["brand"] - როდესაც ვწერთ ნიშნავს, რომ კატეგორიულად ვითხოვთ ამ key-ის მნიშვნელობას და არ ვამოწმებთ არის თუ არა dic-ში მსგავსი key, თუ არ არის მაშინ ტერმინალში გამოგვიტანს შესაბამის error-ს. 
# bike.get("brand") - როდესაც ვწერთ ნიშნავს, რომ ვამოწმებთ არის თუ არა მსგავსი key და თუ არის მას დააბრუნებს. თუ არ გვაქვს მაშინ None-ს დააბრუნებს.