// 1)შექმენით ცვლადი word - გადაეცით თქვენთვის სასურველი სიტყვა, შემდეგ მომხმარებელს შემოატანინეთ სასუველი ენა(მაგ:ქართული,ინგლისური,ფრანგული) და switch-კონსტრუქტორის გამოყენებით გააკეთეთ მარტივი translate როდესაც მომხმარებელი შემოიყვანს მაგალითად "ფრანგულს" თქვენი სიტყვა კონსოლში გადაითარგმნოს "ფრანგულად", ხოლო თუ მომხმარებელი შემოიტანს სხვა სიტყვას მაგ შემთხვევაში კონსოლში გამოიტანოს რომ ასეთი ენა არ არსებობს და ახლიდან სთხოვოს შეყვენა

let language = prompt('ქართული, ინგლისური, კორეული: ')

switch(language){
    case 'ქართული':
        alert('საქართველო <3')
        break
    case 'ინგლისური':
        alert('Georgia <3')
        break
    case 'კორეული':
        alert('그루지야 <3')
        break
    default:
        alert('მასეთ ენაზე თარგმნა არ შემიძლია')
}

