# 3) შექმენით ცვლადი სადაც შეიტანთ string-ს და ეს სტრინგი უნდა გადააქციოთ ინტეჯერად და უნდა ახსნათ კომენტარებით რატო არ შეიძლება რომ ეს string-ი გადავაქციოთ ინტეჯერად

name=input("name: ")
print(int(name))  # არ გადაიქცევა

# ამის გაშვების შემდეგ, ტერმინალში გამოჩნდება ერორი. რადგან name არის string რომელიც არ შეიცავს მთელ რიცხვს. რის გამოც ვერ გადაიქცევა int-ად. გადაიქცეოდა თუ ეს string არის int ბრჭყალებით. ანუ გადიქცევა მაგალითად:

number=input("enter number: ")
print(int(number)) #  გადაიქცევა