#  5) გატესტეთ და ეს კოდი ახსენით კომენტარებით რას აკეთებს 
# num1 = "10"
# num2 = "10"
# print(int(num1) + int(num2))

num1 = "10"
num2 = "10"
print(int(num1) + int(num2)) 
# მოცემულია ცვლადები num1 და num2. num1="10" და num2="10". ორივე შემთხვევაში არის ციფრები რომლებიც არის str სახით მოცემული. print(int(num1) + int(num2)) -ს დროს დაიპრინტება num1 და num2-ს int გადაქცევის შემდეგ მათი ჯამი. ანუ 10+10-ად გადაიქცევა და პასუხი 20 იქნება. int-ების გარეშე რომ ყოფილიყო შეკრება მაშინ პასუხი 1010 იქნებოდა.   