// 5) შექმენით სარეგისტრაციო ფორმა. რეგისტრაციის შემდეგ მომხმარებლის მონაცემი უნდა შეინახოთ სიაში ობიექტის სახით. თითოეულ მომხმარებელს უნდა ჰქონდეს თავისი ობიექტი. ამ ობიექტებს კარგი იქნება თუ შექმნით ობიექტის კონსტრუქტორი ფუნქციის მეშვეობით. გააკეთეთ შემოწმება, რომ მომხმარებელი უკვე დაკავებული ემაილით ვერ დარეგისტრირდეს. 

// რეგისტრაციის ფორმის ქვემოთ შექმენით ავტორიზაციის ფორმა, რომლის დადასტურების შემთხვევაში მოხდება შემოწმება შემოტანილი მონაცემებით თუ არსებობს ექაუნთი და ავტორიზაციის წარმატებით/წარუმატებლად დასრულების შემთხვევაში გამოიტანეთ შესაბამისი alert მესიჯი.


let button = document.querySelector('button')
button.addEventListener('click', function(event){
    event.preventDefault()

    let email = document.getElementsByTagName('input')[0].value
    let password = document.getElementsByTagName('input')[1].value

    myObiect = {
        [email, password],
    }
})