/*
// 1) რა არის useContextი და რისთვის გამოიყენება?.


როდესაც გვინდა, რომ რომელიმე კომპონენტს გადავცეთ რამე მნიშვნელობა/ინფორმაცია, props-ების და დამატებითი ჩალიჩის გარეშე, ამისთვის შეგვიძლია გამოვიყენოთ useContext hook.

* useContext არის რეაქთის ერთ-ერთი ჰუკი, რომელიც გამოიყენება მონაცემის "გასაგზავნად" სხვა კომპონენტში. 
იმისათვის რომ გამოვიყენოთ ეს ჰუკი აუცილებელია რომ დავაიმპორტოთ ისიც როგორც სხვა დანარჩენ ჰუკებს ვაიმპორტებდით.


// საიდანაც მოგვაქვს ინფორმაცია: 

* უკვე მონაცემის გადასაგზავნად აუცილებელია რომ createContext() ფუნქცია გამოვიყენოთ, რომელსაც რეაქთის მოდულიდან ვაიმპორტებთ. (1)

* შემდეგ ვქმნით ცვლადს სადაც ვინახავთ createContext() ფუნქციას. (2)

* ცვლადს, რომელშიც ვინახავთ createContext() ფუნქციას ვიყენებთ როგორც თეგად. გამხსნელ თეგს გადავცემთ ატრიბუტებს. თეგის სახელის შემდეგ იწერება .Provider რაც მონაცემის გადაცემას იწვევს შემდეგ უკვე ვიყენებთ value ატრიბუტს და ამ უკვა =-ის ნიშნის შემდეგ გადავცემთ მნიშვნელობას რომელიც გვინდა, რომ გადავცეთ სხვა კომპონენტებს. (3) გამხსნელსა და დამხურავებს შორის ვიძახებთ უკვე იმ კომპონენტებს რომლებსაც გვინდა რომ გადავცეთ მონაცემები. (4)



// მაგალითი სინტაქსობრივად საიდანაც მოგვაქვს ინფორმაცია

import { createContext } from 'react' (1)
let contextName = createContext()     (2)

<contextName.Provider value={'Hello user (:'}> (3)
    <Component_01/>           (4)
    <Component_02/>
</contextName.Provider>


// სადაც მიგვაქვს ინფორმაცია:

* 'ინფორმაცია' სადაც გვინდა რომ წავიღოთ უკვე იმ კომპონენტში ვაიმპორტებთ useContext hook-ს. (1)

* შემდეგ უკვე useContext()-ს არგუმენტად გადავცემთ იმ ცვლადის სახელს რომელშიც createContext ფუნქციას ვინახავთ (2)


// მაგალითი სინტაქსობრივად სადაც მოგვაქვს ინფორმაცია

import { useContext } from 'react'  (1)

let info = useContext(contextName)  (2)
console.log(info)                   

*/