// 1)შექმენით სია სადაც მოცემული გექნებათ რენდომ სახელები რომებიც იქნება არასწორად დაწერილი(სახელის პირველი ასო პატარა) და ასევე გექნებათ სწორად დაწერილიც(სახელის პირველი ასო დიდი ასოთი) თქვენი მიზანია დაწეროთ ფუნქცია რომელიც გაფილტრავს ამ სიას და დააბრუნებს ახალ სიას სადაც მხოლოდ სწორად დაწერილი სახელები იქნება <3 

let userNameArr = ['Ana', 'Lui', 'Koko', 'lol', 'Hello']

const filteredNames = name => name[0].toUpperCase() === name[0]
let result = userNameArr.filter(filteredNames)
console.log(result)
