# 1) გააკეთეთ 3 ცალი სწორი კოდი და 3 ცალი არასწორი კოდი და უნდა ახსნათ რატომ არის ეს კოდი სწორი და რატომ არის ეს კოდი არასწორი

                                  #არასწორი -> სწორი
#1
print(Hello world) 
#არასწორია, რადგან Hello world უნდა იყოს string და ამიტომ ბრჭყალებში უნდა იყოს. ამიტომ სწორი იქნება
print("hello world")

#2
print(car)
car("BMW")
#არასწორია, რადგან () გამოიყენება print ფუნქციასთან (ამ შემთხვევაში print-თან მარტო, ზოგადად სხვა კოდების წერის დროსაც შეიძლება). ცვლადსა და მნიშვნელს შორის მაკავშირებელი ტოლობაც აკლია. თან კომპიუტერი თანმიმდევრობით კითხულობს. ამიტომ ცვლადის არსებობა რომ გაიგოს ჯერ ცვლადი უნდა ნახოს და შემდეგ დაპრინტავს. ანუ სწორი ვერსია იქნება:
car="BMW" 
print(car)

#3
birth_year=input("enter your birth year:")
print(2024 - birth_year)
#არასწორია. ცვლადში სადაც არის მოცემული birth_year=input("enter your birth year:"), წინადადება არის ბრჭყალებში, ანუ string-ია. შესაბამისად აუცილებელია, რომ ამ კითხვაზე პასუხი იყოს string, ან თავად ეს კითხვა გახდეს integer. ამიტომ სწორი ვერსიები იქნება:
        
         # ვერსია 1
birth_year=int(input("enter your birth year:"))
print(2024 - birth_year)
         # ვერსია 2
birth_year=input("enter your birth year:")
print(2024 - int(birth_year))

                                
                                    #სწორი
#1
print("hello, i am Ana")
#სწორია. ფრჩხილები სჭირდება print-ის გამო. და ფრჩხილებში მოცებული წინადადება არის string რადგან ბრჭყალებშია.

#2
motorcycle="kawasaki"
print(motorcycle)
#ამ ცვლადში არასწორი არაფერია. kawasaki არის წინადადება რომელიც აუცილებლად string უნდა იყოს და ამიტომ ბრჭყალები სჭირდება. = ცვლადსა და მნიშვნელს შორის მაკაშვირებელ როლს ასრულებს. ამიტომ საჭიროა.

#3
name=input("plsease enter your name:" )
lastname=input("enter your last namea: ")
print("hello " + name + " " + lastname + ", how can i help you? ")
#სწორია ყველაფერი. ცვლადებიც სწორად არის შექმნილი. და print ბოლოშ არის. თანმიმდევრობით არის. 