function main(){
    alert('მოგესალმებით ყველას ! \nამ ჯგუფური პროექტის გაკეთებაში მონაწილეობა მიიღეს: \nანა ფუთურიძემ (კაპირანი), \nსოფია გორგაძემ \n გიორგი ჯანხოთელმა');
    alert('რაც შეეხება მთავარ გვერდს, ამ გვერდის ავტორია ანა ფუთურიძე')
}

function chad(){
    alert('ჩადური მენიუს გვერდის ავტორია ანა ფუთურიძე')
}

function civi(){
    alert('ცივი საჭმელების გვერდის ავტორია გიორგი ჯანხოთელი')
}

function registration(){
    alert('სარეგისტრაციო ველის ავტორია სოფია გორგაძე')
}

function salatebi(){
    alert('სალათის გვერდის ავტორია გიორგი ჯანხოთელი')
}

function sasmelebi(){
    alert('სასმელების გვერდის ავტორია სოფია გორგაძე')
}

function xinklebi(){
    alert('ხინკლის გვერდის ავტორია სოფია გორგაძე')
}
function comeuli(){
    alert('ცომეულის გვერდის ავტორია ანა ფუთურიძე')
}