// 2) მომხმარებელს შემოატანინეთ თვის სახელი მაგ:("იანვარი" , "თებერვალი") , თქვენი მიზანია დაადგინოთ მომხმარებლის შემოტანილი თვე სეზონის რომელი პერიოდია (ზაფხული,ზამთარი,შემოდგომა,თუ გაზაფხული)

// let spring = ['მარტი', 'აპრილი', 'მაისი']
// let summer = ['ივნისი', 'ივლისი', 'აგვისტო']
// let autumn = ['სექტემბერი', 'ოქტომბერი', 'ნოემბერი']
// let winter = ['დეკემბერი', 'იანვარი', 'თებერვალი']

let userMonth = prompt('Enter month: ')

switch(userMonth){
    case 'მარტი':
    case 'აპრილი':
    case 'მაისი':
        alert('გაზაფხული')
        break

    case 'ივნისი':
    case 'ივლისი':
    case 'აგვისტო':
        alert('ზაფხული')
        break

    case 'სექტემბერი':
    case 'ოქტომბერი':
    case 'ნოემბერი':
        alert('შემოდგომა')
        break
    
    case 'დეკემბერი':
    case 'იანვარი':
    case 'თებერვალი':
        alert('ზამთარი')
        break
    
    default:
        alert('არ არსებობს მასეთი თვე')

}