/* 
3) შექმენით PasswordInput კომპონენტი
ამ კომპონენტმა უნდა დაარენდეროს input ტეგი და ღილაკი
--> მომხმარებელს უნდა შეეძლოს ამ input ტეგში ჩაწეროს თავისი პაროლი
--> ღილაკზე დაჭერით: 
    -თუ ტექსტი ჩანს უნდა დაიფაროს(ჩანაცვლდეს ფიფქებით)
    -თუ ტექსტი არ ჩანს(ანუ ფიფქებია), კვლავ უნდა გამოჩნდეს ტექსტი
P.S ფიფქების რაოდენობა input ტეგში უნდა უდრიდეს მომხმარებლის მიერ შემოყვანილი პაროლის სიგრძეს
*/

import PasswordInput from './PasswordInput.jsx'

function App() {
  return (
    <PasswordInput />
  )
}

export default App
