# print() - ტერმინალში გამოაქვს 
# input() - 
# ლოგიკური ოპერატორები - or / and
# მათემატიკური ოპერატორები - მიმატება/გამოკლება
# შედარების ოპერატორები 
# მონაცემთა ტიპები 
# == - შედარებას ნიშნავს
# იდენტაცია ოთხი სფეისით მარჯვნივ გადასვლას კიდედან ნიშნავს
# odd - კენტი
# even - ლუწი
# flow - დინება

# ბევრი if გამოყენება არ შეიძლება, თუ მათი შედარება არის საჭირო მაშინ elif ვიყენებთ.

# if თუ არ დაკმაყოფილდა ამ შემთხვევაში უნდა გადავიდეს elif-ზე. მაგრამ თუ მარტო if-ებს დავწერთ პირობა თავიდან ამუშავდება. 

# Sequences - თანმიმდევრულად უშვებს კოდს
# iteration - გამეორება
# selections - არჩევა

# algorithm - ნაბიჯ-ნაბიჯ დავალების შესრულება რაიმე მიზნის მისაღწევად.

# flowchats - ალგორითმის ვიზუალისაცია 

# / - გაყოფა
# * - გამრავლება 
# % - ნაშთს აბრუნებს.
# // - უმცირესი მთელი
# + - მიმატება
# - - გამოკლება


name = "Ana"

if name == "Ana":
    print("student")
else:
    print("IDK")

product_name = input("Enter product name: ")
if product_name == "ლავაში":
    print("ვიყიდოთ ლავაში")
elif product_name == "დაჭრილი პური":
    print('ვიყიდოთ')
elif product_name == "შავი პური":
    print('ვიყიდოთ შავი პური')
else: 
    print("არაფერს ვყიდულობთ")

