'''1) შექმენით ერთი სია რომელშიც შეიტანთ სახელებს შემდეგ შექმენით მეორე სია რომელშიც იქნება ისევ სხვადასხვა სახელები გააერთიანეთ ეს ორი სია ჩაამატეთ 5 ინდექსზე ახალი სახელი დაითვალეთ გაერთიანებული სიის სიგრძე და დაითვალეთ თქვენი სახელი რამდენჯერ გვხვდება ამ სიაში, ასევე დაბეჭდეთ რომელ ინდექსზე დგას თქვენი სახელი'''


list = ['Ana', 'Elene', 'Niko', 'Nitsa']
list_1 = ['saba', 'jimshera', 'gio']

list_2 = list.extend(list_1)
list_2.insert(5, 'jimshera 2')

len(list_2)
list_2.count('Ana')
list_2.index('Ana')

