#           ლისტების ფუნქციები

# index ფუნქცია - აქ იწერება ელემენტი რომლის ინდექსის გაგებაც გვინდა.
#       სახელი.index('saxeli'). თუ ელემენტი არ არსებობს მაშინ ერორი იქნება. 

# insert - ფუნქციის საშუალებით კონკრეტულ ინდექსზე ვამატებთ ელემენტს
#       სახელი.insert(1, 'elementi') - პირიველ ინდექსზე დაემატება ელემენტი

# extend - სიების გაერთიანება
#       სახელი სიის სადაც ვამატებთ.extend(elementi რომელსაც ვამატებთ)

# count - ითვლის გადაცემული ელემენტი რამდენი არის სიაში 

# remove - შლის ელემენტებს
# pop - შლის ელემენტს ინდექსის მიხედვით