/* 
4) შექმენით NumberGuesser კომპონენტი.
რა არის NumberGuesser ალბათ იცით.
პროგრამა ჩაიფიქრებს რიცხვს რაღაც შუალედში, ხოლო მომხმარებელი ცდილობს გამოიცნოს
პროგრამა ეხმარება მომხმარებელს:
-> ეუბნება მისი შემოყვანილი რიცხვი მეტია თუ ნაკლებია ჩაფიქრებულზე.
როცა მომხმარებელი გამოიცნობს რიცხვს გამოაჩინეთ 1 დავალების შესაბამისი Toast 
დაამატეთ ხელახლა დაწყების ღილაკი
---> ეს დავალება მინი პროექტად შეგიძლიათ აქციოთ, დაიხმარეთ ფანტაზია - დაამატეთ როგორც ფუნქციონალი ისე შეალამაზეთ იგი ვიზუალურად.
*/

import NumberGuesser from './NumberGuesser.jsx'

function App() {
  return (
    <NumberGuesser/>
  )
}

export default App
