'''15
15
16
16
16
16
16
16
15
17
17
17
17
19
21
21
23
25
25
26
32 

ეს არის თქვენი ჯგუფის წევრების ასაკები, 

დავალება:

შექმენით პროგრამა რომელიც გამოითვლის ჯგუფის საშუალო ასაკს. 
ასევე გამოითვალეთ ყველაზე ხშირად რომელი ასაკი გვხვდება'''

age = [15, 15, 16, 16, 16, 16, 16, 16, 15, 17, 17, 17, 17, 19, 21, 21, 23, 25, 25, 26, 32]

print(sum(age)//len(age))

# task 2

first_rank = age[0]
for i in age:
    if age.count(i) > age.count(first_rank):
        first_rank = i
print(f'ყველაზე ხშირად მეორდება ასაკი {first_rank} რომელიც {age.count(first_rank)}-ჯერ გვხვდება ჯგუფ 50-ში')