'''15,15, 16, 16, 16, 16, 16, 16, 15, 17, 17, 17, 17, 19, 21, 21, 23, 25, 25, 26, 32 

ეს არის თქვენი ჯგუფის წევრების ასაკები, 

დავალება:

შექმენით პროგრამა რომელიც გამოითვლის ჯგუფის საშუალო ასაკს. 
ასევე გამოითვალეთ ყველაზე ხშირად რომელი ასაკი გვხვდება'''

age = [15, 15, 16, 16, 16, 16, 16, 16, 15, 17, 17, 17, 17, 19, 21, 21, 23, 25, 25, 26, 32]

print(sum(age)//len(age))

# task 2

first_rank = age[0]
for element in age:
    if age.count(element) > age.count(first_rank):
        first_rank = element
print(str(first_rank) + ' მეორდება '+ str(age.count(first_rank)))

