// 1) რა არის useEffect და რისთვის ვიყენებთ მას React-ში?

// useEffect ერთ-ერთი Hook-ია, რომელსაც მეორე არგუმენტად, სიის სახით გადავცემთ ერთ ან რამდენიმე state-ს და ამ state-ებს უთვალთვალებს. state-ის მნიშვნელობის შეცვლის შემდეგ ასრულებს იმ ფუნქციას რასაც გადავცემთ პირველ არგუმენტად.

// სინტაქსი:

// import { useEffect, useState } from 'react'  --->   useState-ის მსგავსია, react-ის მოდულიდან ვაიმპორტებთ.
// let [value, setValue] = useState('none')

// useEffect(
// ()= >{ ----->  გადავეცით პირველ არგუმენტად ანონიმუს ფუნქცია, რომელიც შესრულდება საიტის პირველად ჩატვირთვის დროს და value-ს მნიშვნელობა რამდენჯერაც შეიცვლება
    // console.log('hello')
// }, [value])  --- აქ გადავცემთ სიაში თუ რომელ state-ებს უნდა უთვალთვალოს. state-ის სახელს.

// უშუალოდ მაშინ ვიყენებთ როდესაც რომელიმე state-ს მნიშვნელობის ცვლილების შემდეგ გვინდა, რომ პარალელურად რამე ფუნქცია შესრულდეს. 